{"clean_prefix": "Then, Alexander and Michelle went to the restaurant. Michelle gave a bone to", "patch_prefix": "Then, Michelle and Alexander went to the restaurant. Alexander gave a bone to", "clean_answer": " Alexander", "patch_answer": " Michelle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Richard and Paul went to the garden. Paul gave a necklace to", "patch_prefix": "Then, Paul and Richard went to the garden. Richard gave a necklace to", "clean_answer": " Richard", "patch_answer": " Paul", "case": "ioi_dataset"}
{"clean_prefix": "Then, Finn and Jeremy went to the station. Jeremy gave a drink to", "patch_prefix": "Then, Jeremy and Finn went to the station. Finn gave a drink to", "clean_answer": " Finn", "patch_answer": " Jeremy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jonathan and Adam went to the garden. Adam gave a bone to", "patch_prefix": "Then, Adam and Jonathan went to the garden. Jonathan gave a bone to", "clean_answer": " Jonathan", "patch_answer": " Adam", "case": "ioi_dataset"}
{"clean_prefix": "Then, Helen and Benjamin went to the garden. Benjamin gave a computer to", "patch_prefix": "Then, Benjamin and Helen went to the garden. Helen gave a computer to", "clean_answer": " Helen", "patch_answer": " Benjamin", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bradley and Eric went to the house. Eric gave a kiss to", "patch_prefix": "Then, Eric and Bradley went to the house. Bradley gave a kiss to", "clean_answer": " Bradley", "patch_answer": " Eric", "case": "ioi_dataset"}
{"clean_prefix": "Then, Anthony and Mark went to the office. Mark gave a ring to", "patch_prefix": "Then, Mark and Anthony went to the office. Anthony gave a ring to", "clean_answer": " Anthony", "patch_answer": " Mark", "case": "ioi_dataset"}
{"clean_prefix": "Then, Luke and Michael went to the store. Michael gave a drink to", "patch_prefix": "Then, Michael and Luke went to the store. Luke gave a drink to", "clean_answer": " Luke", "patch_answer": " Michael", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jason and Matthew went to the house. Matthew gave a kiss to", "patch_prefix": "Then, Matthew and Jason went to the house. Jason gave a kiss to", "clean_answer": " Jason", "patch_answer": " Matthew", "case": "ioi_dataset"}
{"clean_prefix": "Then, Ryan and Bob went to the school. Bob gave a basketball to", "patch_prefix": "Then, Bob and Ryan went to the school. Ryan gave a basketball to", "clean_answer": " Ryan", "patch_answer": " Bob", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christopher and James went to the store. James gave a kiss to", "patch_prefix": "Then, James and Christopher went to the store. Christopher gave a kiss to", "clean_answer": " Christopher", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Katherine and Nicholas went to the garden. Nicholas gave a drink to", "patch_prefix": "Then, Nicholas and Katherine went to the garden. Katherine gave a drink to", "clean_answer": " Katherine", "patch_answer": " Nicholas", "case": "ioi_dataset"}
{"clean_prefix": "Then, Lindsay and Bob went to the restaurant. Bob gave a bone to", "patch_prefix": "Then, Bob and Lindsay went to the restaurant. Lindsay gave a bone to", "clean_answer": " Lindsay", "patch_answer": " Bob", "case": "ioi_dataset"}
{"clean_prefix": "Then, Joshua and Steven went to the restaurant. Steven gave a computer to", "patch_prefix": "Then, Steven and Joshua went to the restaurant. Joshua gave a computer to", "clean_answer": " Joshua", "patch_answer": " Steven", "case": "ioi_dataset"}
{"clean_prefix": "Then, Ryan and Luke went to the school. Luke gave a bone to", "patch_prefix": "Then, Luke and Ryan went to the school. Ryan gave a bone to", "clean_answer": " Ryan", "patch_answer": " Luke", "case": "ioi_dataset"}
{"clean_prefix": "Then, Susan and Crystal went to the garden. Crystal gave a necklace to", "patch_prefix": "Then, Crystal and Susan went to the garden. Susan gave a necklace to", "clean_answer": " Susan", "patch_answer": " Crystal", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kenneth and Crystal went to the school. Crystal gave a drink to", "patch_prefix": "Then, Crystal and Kenneth went to the school. Kenneth gave a drink to", "clean_answer": " Kenneth", "patch_answer": " Crystal", "case": "ioi_dataset"}
{"clean_prefix": "Then, Lisa and Sophie went to the house. Sophie gave a necklace to", "patch_prefix": "Then, Sophie and Lisa went to the house. Lisa gave a necklace to", "clean_answer": " Lisa", "patch_answer": " Sophie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jacob and Andrew went to the school. Andrew gave a snack to", "patch_prefix": "Then, Andrew and Jacob went to the school. Jacob gave a snack to", "clean_answer": " Jacob", "patch_answer": " Andrew", "case": "ioi_dataset"}
{"clean_prefix": "Then, Lauren and Robert went to the hospital. Robert gave a kiss to", "patch_prefix": "Then, Robert and Lauren went to the hospital. Lauren gave a kiss to", "clean_answer": " Lauren", "patch_answer": " Robert", "case": "ioi_dataset"}
{"clean_prefix": "Then, Matthew and Jeremy went to the house. Jeremy gave a snack to", "patch_prefix": "Then, Jeremy and Matthew went to the house. Matthew gave a snack to", "clean_answer": " Matthew", "patch_answer": " Jeremy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Luke and Megan went to the garden. Megan gave a drink to", "patch_prefix": "Then, Megan and Luke went to the garden. Luke gave a drink to", "clean_answer": " Luke", "patch_answer": " Megan", "case": "ioi_dataset"}
{"clean_prefix": "Then, John and Bob went to the office. Bob gave a necklace to", "patch_prefix": "Then, Bob and John went to the office. John gave a necklace to", "clean_answer": " John", "patch_answer": " Bob", "case": "ioi_dataset"}
{"clean_prefix": "Then, Allison and Christina went to the hospital. Christina gave a ring to", "patch_prefix": "Then, Christina and Allison went to the hospital. Allison gave a ring to", "clean_answer": " Allison", "patch_answer": " Christina", "case": "ioi_dataset"}
{"clean_prefix": "Then, Stephanie and Kevin went to the garden. Kevin gave a bone to", "patch_prefix": "Then, Kevin and Stephanie went to the garden. Stephanie gave a bone to", "clean_answer": " Stephanie", "patch_answer": " Kevin", "case": "ioi_dataset"}
{"clean_prefix": "Then, Joshua and Amanda went to the school. Amanda gave a drink to", "patch_prefix": "Then, Amanda and Joshua went to the school. Joshua gave a drink to", "clean_answer": " Joshua", "patch_answer": " Amanda", "case": "ioi_dataset"}
{"clean_prefix": "Then, Alexander and Christopher went to the hospital. Christopher gave a bone to", "patch_prefix": "Then, Christopher and Alexander went to the hospital. Alexander gave a bone to", "clean_answer": " Alexander", "patch_answer": " Christopher", "case": "ioi_dataset"}
{"clean_prefix": "Then, Mary and Thomas went to the garden. Thomas gave a computer to", "patch_prefix": "Then, Thomas and Mary went to the garden. Mary gave a computer to", "clean_answer": " Mary", "patch_answer": " Thomas", "case": "ioi_dataset"}
{"clean_prefix": "Then, Daniel and Charles went to the restaurant. Charles gave a drink to", "patch_prefix": "Then, Charles and Daniel went to the restaurant. Daniel gave a drink to", "clean_answer": " Daniel", "patch_answer": " Charles", "case": "ioi_dataset"}
{"clean_prefix": "Then, Cody and Mason went to the station. Mason gave a necklace to", "patch_prefix": "Then, Mason and Cody went to the station. Cody gave a necklace to", "clean_answer": " Cody", "patch_answer": " Mason", "case": "ioi_dataset"}
{"clean_prefix": "Then, Joshua and Thomas went to the restaurant. Thomas gave a bone to", "patch_prefix": "Then, Thomas and Joshua went to the restaurant. Joshua gave a bone to", "clean_answer": " Joshua", "patch_answer": " Thomas", "case": "ioi_dataset"}
{"clean_prefix": "Then, William and Eric went to the school. Eric gave a bone to", "patch_prefix": "Then, Eric and William went to the school. William gave a bone to", "clean_answer": " William", "patch_answer": " Eric", "case": "ioi_dataset"}
{"clean_prefix": "Then, Sean and Bryan went to the house. Bryan gave a kiss to", "patch_prefix": "Then, Bryan and Sean went to the house. Sean gave a kiss to", "clean_answer": " Sean", "patch_answer": " Bryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Gregory and Kelly went to the hospital. Kelly gave a kiss to", "patch_prefix": "Then, Kelly and Gregory went to the hospital. Gregory gave a kiss to", "clean_answer": " Gregory", "patch_answer": " Kelly", "case": "ioi_dataset"}
{"clean_prefix": "Then, Andrea and Rachel went to the garden. Rachel gave a computer to", "patch_prefix": "Then, Rachel and Andrea went to the garden. Andrea gave a computer to", "clean_answer": " Andrea", "patch_answer": " Rachel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jason and Joseph went to the station. Joseph gave a snack to", "patch_prefix": "Then, Joseph and Jason went to the station. Jason gave a snack to", "clean_answer": " Jason", "patch_answer": " Joseph", "case": "ioi_dataset"}
{"clean_prefix": "Then, Nathan and Lindsay went to the store. Lindsay gave a ring to", "patch_prefix": "Then, Lindsay and Nathan went to the store. Nathan gave a ring to", "clean_answer": " Nathan", "patch_answer": " Lindsay", "case": "ioi_dataset"}
{"clean_prefix": "Then, Megan and Sean went to the office. Sean gave a snack to", "patch_prefix": "Then, Sean and Megan went to the office. Megan gave a snack to", "clean_answer": " Megan", "patch_answer": " Sean", "case": "ioi_dataset"}
{"clean_prefix": "Then, Ashley and Jesse went to the garden. Jesse gave a ring to", "patch_prefix": "Then, Jesse and Ashley went to the garden. Ashley gave a ring to", "clean_answer": " Ashley", "patch_answer": " Jesse", "case": "ioi_dataset"}
{"clean_prefix": "Then, Aaron and Bryan went to the garden. Bryan gave a basketball to", "patch_prefix": "Then, Bryan and Aaron went to the garden. Aaron gave a basketball to", "clean_answer": " Aaron", "patch_answer": " Bryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jose and Billy went to the garden. Billy gave a kiss to", "patch_prefix": "Then, Billy and Jose went to the garden. Jose gave a kiss to", "clean_answer": " Jose", "patch_answer": " Billy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Amy and Jesse went to the station. Jesse gave a ring to", "patch_prefix": "Then, Jesse and Amy went to the station. Amy gave a ring to", "clean_answer": " Amy", "patch_answer": " Jesse", "case": "ioi_dataset"}
{"clean_prefix": "Then, Amber and James went to the store. James gave a snack to", "patch_prefix": "Then, James and Amber went to the store. Amber gave a snack to", "clean_answer": " Amber", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bryan and Sarah went to the station. Sarah gave a bone to", "patch_prefix": "Then, Sarah and Bryan went to the station. Bryan gave a bone to", "clean_answer": " Bryan", "patch_answer": " Sarah", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jeffrey and Allison went to the station. Allison gave a bone to", "patch_prefix": "Then, Allison and Jeffrey went to the station. Jeffrey gave a bone to", "clean_answer": " Jeffrey", "patch_answer": " Allison", "case": "ioi_dataset"}
{"clean_prefix": "Then, Eric and Joseph went to the store. Joseph gave a kiss to", "patch_prefix": "Then, Joseph and Eric went to the store. Eric gave a kiss to", "clean_answer": " Eric", "patch_answer": " Joseph", "case": "ioi_dataset"}
{"clean_prefix": "Then, Shannon and James went to the garden. James gave a ring to", "patch_prefix": "Then, James and Shannon went to the garden. Shannon gave a ring to", "clean_answer": " Shannon", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Katie and Tyler went to the office. Tyler gave a kiss to", "patch_prefix": "Then, Tyler and Katie went to the office. Katie gave a kiss to", "clean_answer": " Katie", "patch_answer": " Tyler", "case": "ioi_dataset"}
{"clean_prefix": "Then, Michael and Melissa went to the school. Melissa gave a ring to", "patch_prefix": "Then, Melissa and Michael went to the school. Michael gave a ring to", "clean_answer": " Michael", "patch_answer": " Melissa", "case": "ioi_dataset"}
{"clean_prefix": "Then, Melissa and Alexander went to the garden. Alexander gave a drink to", "patch_prefix": "Then, Alexander and Melissa went to the garden. Melissa gave a drink to", "clean_answer": " Melissa", "patch_answer": " Alexander", "case": "ioi_dataset"}
{"clean_prefix": "Then, Melissa and Jamie went to the school. Jamie gave a ring to", "patch_prefix": "Then, Jamie and Melissa went to the school. Melissa gave a ring to", "clean_answer": " Melissa", "patch_answer": " Jamie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Brandon and Kyle went to the restaurant. Kyle gave a necklace to", "patch_prefix": "Then, Kyle and Brandon went to the restaurant. Brandon gave a necklace to", "clean_answer": " Brandon", "patch_answer": " Kyle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Michael and Kyle went to the store. Kyle gave a necklace to", "patch_prefix": "Then, Kyle and Michael went to the store. Michael gave a necklace to", "clean_answer": " Michael", "patch_answer": " Kyle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Megan and Charles went to the office. Charles gave a snack to", "patch_prefix": "Then, Charles and Megan went to the office. Megan gave a snack to", "clean_answer": " Megan", "patch_answer": " Charles", "case": "ioi_dataset"}
{"clean_prefix": "Then, Emily and Jacob went to the garden. Jacob gave a computer to", "patch_prefix": "Then, Jacob and Emily went to the garden. Emily gave a computer to", "clean_answer": " Emily", "patch_answer": " Jacob", "case": "ioi_dataset"}
{"clean_prefix": "Then, Travis and Sean went to the house. Sean gave a bone to", "patch_prefix": "Then, Sean and Travis went to the house. Travis gave a bone to", "clean_answer": " Travis", "patch_answer": " Sean", "case": "ioi_dataset"}
{"clean_prefix": "Then, Emily and Amanda went to the garden. Amanda gave a bone to", "patch_prefix": "Then, Amanda and Emily went to the garden. Emily gave a bone to", "clean_answer": " Emily", "patch_answer": " Amanda", "case": "ioi_dataset"}
{"clean_prefix": "Then, Andrea and Matthew went to the school. Matthew gave a necklace to", "patch_prefix": "Then, Matthew and Andrea went to the school. Andrea gave a necklace to", "clean_answer": " Andrea", "patch_answer": " Matthew", "case": "ioi_dataset"}
{"clean_prefix": "Then, Katie and James went to the station. James gave a drink to", "patch_prefix": "Then, James and Katie went to the station. Katie gave a drink to", "clean_answer": " Katie", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bill and Andrea went to the office. Andrea gave a kiss to", "patch_prefix": "Then, Andrea and Bill went to the office. Bill gave a kiss to", "clean_answer": " Bill", "patch_answer": " Andrea", "case": "ioi_dataset"}
{"clean_prefix": "Then, Allison and Gregory went to the station. Gregory gave a basketball to", "patch_prefix": "Then, Gregory and Allison went to the station. Allison gave a basketball to", "clean_answer": " Allison", "patch_answer": " Gregory", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bob and Angela went to the garden. Angela gave a snack to", "patch_prefix": "Then, Angela and Bob went to the garden. Bob gave a snack to", "clean_answer": " Bob", "patch_answer": " Angela", "case": "ioi_dataset"}
{"clean_prefix": "Then, Timothy and Katherine went to the garden. Katherine gave a basketball to", "patch_prefix": "Then, Katherine and Timothy went to the garden. Timothy gave a basketball to", "clean_answer": " Timothy", "patch_answer": " Katherine", "case": "ioi_dataset"}
{"clean_prefix": "Then, Laura and Jennifer went to the restaurant. Jennifer gave a necklace to", "patch_prefix": "Then, Jennifer and Laura went to the restaurant. Laura gave a necklace to", "clean_answer": " Laura", "patch_answer": " Jennifer", "case": "ioi_dataset"}
{"clean_prefix": "Then, Helen and John went to the house. John gave a drink to", "patch_prefix": "Then, John and Helen went to the house. Helen gave a drink to", "clean_answer": " Helen", "patch_answer": " John", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bryan and Paul went to the office. Paul gave a necklace to", "patch_prefix": "Then, Paul and Bryan went to the office. Bryan gave a necklace to", "clean_answer": " Bryan", "patch_answer": " Paul", "case": "ioi_dataset"}
{"clean_prefix": "Then, Nicholas and Lauren went to the restaurant. Lauren gave a bone to", "patch_prefix": "Then, Lauren and Nicholas went to the restaurant. Nicholas gave a bone to", "clean_answer": " Nicholas", "patch_answer": " Lauren", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christopher and Rachel went to the store. Rachel gave a computer to", "patch_prefix": "Then, Rachel and Christopher went to the store. Christopher gave a computer to", "clean_answer": " Christopher", "patch_answer": " Rachel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Tyler and Billy went to the house. Billy gave a kiss to", "patch_prefix": "Then, Billy and Tyler went to the house. Tyler gave a kiss to", "clean_answer": " Tyler", "patch_answer": " Billy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Timothy and Justin went to the station. Justin gave a snack to", "patch_prefix": "Then, Justin and Timothy went to the station. Timothy gave a snack to", "clean_answer": " Timothy", "patch_answer": " Justin", "case": "ioi_dataset"}
{"clean_prefix": "Then, Stephanie and Amber went to the office. Amber gave a ring to", "patch_prefix": "Then, Amber and Stephanie went to the office. Stephanie gave a ring to", "clean_answer": " Stephanie", "patch_answer": " Amber", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jeffrey and Matthew went to the restaurant. Matthew gave a kiss to", "patch_prefix": "Then, Matthew and Jeffrey went to the restaurant. Jeffrey gave a kiss to", "clean_answer": " Jeffrey", "patch_answer": " Matthew", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jason and Richard went to the restaurant. Richard gave a drink to", "patch_prefix": "Then, Richard and Jason went to the restaurant. Jason gave a drink to", "clean_answer": " Jason", "patch_answer": " Richard", "case": "ioi_dataset"}
{"clean_prefix": "Then, Angela and Nicholas went to the house. Nicholas gave a ring to", "patch_prefix": "Then, Nicholas and Angela went to the house. Angela gave a ring to", "clean_answer": " Angela", "patch_answer": " Nicholas", "case": "ioi_dataset"}
{"clean_prefix": "Then, Mason and Amy went to the office. Amy gave a ring to", "patch_prefix": "Then, Amy and Mason went to the office. Mason gave a ring to", "clean_answer": " Mason", "patch_answer": " Amy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Emily and Erin went to the school. Erin gave a kiss to", "patch_prefix": "Then, Erin and Emily went to the school. Emily gave a kiss to", "clean_answer": " Emily", "patch_answer": " Erin", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bryan and James went to the hospital. James gave a basketball to", "patch_prefix": "Then, James and Bryan went to the hospital. Bryan gave a basketball to", "clean_answer": " Bryan", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Scott and Brian went to the store. Brian gave a necklace to", "patch_prefix": "Then, Brian and Scott went to the store. Scott gave a necklace to", "clean_answer": " Scott", "patch_answer": " Brian", "case": "ioi_dataset"}
{"clean_prefix": "Then, Stephanie and Matthew went to the school. Matthew gave a necklace to", "patch_prefix": "Then, Matthew and Stephanie went to the school. Stephanie gave a necklace to", "clean_answer": " Stephanie", "patch_answer": " Matthew", "case": "ioi_dataset"}
{"clean_prefix": "Then, Luke and Brandon went to the hospital. Brandon gave a drink to", "patch_prefix": "Then, Brandon and Luke went to the hospital. Luke gave a drink to", "clean_answer": " Luke", "patch_answer": " Brandon", "case": "ioi_dataset"}
{"clean_prefix": "Then, David and Emily went to the station. Emily gave a snack to", "patch_prefix": "Then, Emily and David went to the station. David gave a snack to", "clean_answer": " David", "patch_answer": " Emily", "case": "ioi_dataset"}
{"clean_prefix": "Then, Laura and Stephanie went to the school. Stephanie gave a drink to", "patch_prefix": "Then, Stephanie and Laura went to the school. Laura gave a drink to", "clean_answer": " Laura", "patch_answer": " Stephanie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jeremy and Ashley went to the restaurant. Ashley gave a computer to", "patch_prefix": "Then, Ashley and Jeremy went to the restaurant. Jeremy gave a computer to", "clean_answer": " Jeremy", "patch_answer": " Ashley", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kelly and Sophie went to the garden. Sophie gave a snack to", "patch_prefix": "Then, Sophie and Kelly went to the garden. Kelly gave a snack to", "clean_answer": " Kelly", "patch_answer": " Sophie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Melissa and Michelle went to the office. Michelle gave a ring to", "patch_prefix": "Then, Michelle and Melissa went to the office. Melissa gave a ring to", "clean_answer": " Melissa", "patch_answer": " Michelle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Susan and Amanda went to the station. Amanda gave a computer to", "patch_prefix": "Then, Amanda and Susan went to the station. Susan gave a computer to", "clean_answer": " Susan", "patch_answer": " Amanda", "case": "ioi_dataset"}
{"clean_prefix": "Then, Anthony and Christopher went to the station. Christopher gave a kiss to", "patch_prefix": "Then, Christopher and Anthony went to the station. Anthony gave a kiss to", "clean_answer": " Anthony", "patch_answer": " Christopher", "case": "ioi_dataset"}
{"clean_prefix": "Then, Rachel and Christina went to the store. Christina gave a bone to", "patch_prefix": "Then, Christina and Rachel went to the store. Rachel gave a bone to", "clean_answer": " Rachel", "patch_answer": " Christina", "case": "ioi_dataset"}
{"clean_prefix": "Then, Steven and Michelle went to the office. Michelle gave a necklace to", "patch_prefix": "Then, Michelle and Steven went to the office. Steven gave a necklace to", "clean_answer": " Steven", "patch_answer": " Michelle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Gregory and Samuel went to the restaurant. Samuel gave a basketball to", "patch_prefix": "Then, Samuel and Gregory went to the restaurant. Gregory gave a basketball to", "clean_answer": " Gregory", "patch_answer": " Samuel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Joshua and Anthony went to the hospital. Anthony gave a snack to", "patch_prefix": "Then, Anthony and Joshua went to the hospital. Joshua gave a snack to", "clean_answer": " Joshua", "patch_answer": " Anthony", "case": "ioi_dataset"}
{"clean_prefix": "Then, Amy and Mary went to the garden. Mary gave a kiss to", "patch_prefix": "Then, Mary and Amy went to the garden. Amy gave a kiss to", "clean_answer": " Amy", "patch_answer": " Mary", "case": "ioi_dataset"}
{"clean_prefix": "Then, Luke and Rebecca went to the store. Rebecca gave a basketball to", "patch_prefix": "Then, Rebecca and Luke went to the store. Luke gave a basketball to", "clean_answer": " Luke", "patch_answer": " Rebecca", "case": "ioi_dataset"}
{"clean_prefix": "Then, Angela and Lisa went to the office. Lisa gave a basketball to", "patch_prefix": "Then, Lisa and Angela went to the office. Angela gave a basketball to", "clean_answer": " Angela", "patch_answer": " Lisa", "case": "ioi_dataset"}
{"clean_prefix": "Then, Douglas and Angela went to the house. Angela gave a ring to", "patch_prefix": "Then, Angela and Douglas went to the house. Douglas gave a ring to", "clean_answer": " Douglas", "patch_answer": " Angela", "case": "ioi_dataset"}
{"clean_prefix": "Then, Andrea and Laura went to the station. Laura gave a computer to", "patch_prefix": "Then, Laura and Andrea went to the station. Andrea gave a computer to", "clean_answer": " Andrea", "patch_answer": " Laura", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jacob and Katherine went to the garden. Katherine gave a ring to", "patch_prefix": "Then, Katherine and Jacob went to the garden. Jacob gave a ring to", "clean_answer": " Jacob", "patch_answer": " Katherine", "case": "ioi_dataset"}
{"clean_prefix": "Then, Finn and Samuel went to the school. Samuel gave a drink to", "patch_prefix": "Then, Samuel and Finn went to the school. Finn gave a drink to", "clean_answer": " Finn", "patch_answer": " Samuel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Crystal and Patrick went to the garden. Patrick gave a drink to", "patch_prefix": "Then, Patrick and Crystal went to the garden. Crystal gave a drink to", "clean_answer": " Crystal", "patch_answer": " Patrick", "case": "ioi_dataset"}
{"clean_prefix": "Then, Daniel and Shannon went to the office. Shannon gave a drink to", "patch_prefix": "Then, Shannon and Daniel went to the office. Daniel gave a drink to", "clean_answer": " Daniel", "patch_answer": " Shannon", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jessica and Rachel went to the garden. Rachel gave a drink to", "patch_prefix": "Then, Rachel and Jessica went to the garden. Jessica gave a drink to", "clean_answer": " Jessica", "patch_answer": " Rachel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Nicole and Kenneth went to the restaurant. Kenneth gave a ring to", "patch_prefix": "Then, Kenneth and Nicole went to the restaurant. Nicole gave a ring to", "clean_answer": " Nicole", "patch_answer": " Kenneth", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christina and Luke went to the garden. Luke gave a ring to", "patch_prefix": "Then, Luke and Christina went to the garden. Christina gave a ring to", "clean_answer": " Christina", "patch_answer": " Luke", "case": "ioi_dataset"}
{"clean_prefix": "Then, Stephen and Alexander went to the house. Alexander gave a computer to", "patch_prefix": "Then, Alexander and Stephen went to the house. Stephen gave a computer to", "clean_answer": " Stephen", "patch_answer": " Alexander", "case": "ioi_dataset"}
{"clean_prefix": "Then, Cody and Rachel went to the house. Rachel gave a bone to", "patch_prefix": "Then, Rachel and Cody went to the house. Cody gave a bone to", "clean_answer": " Cody", "patch_answer": " Rachel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Rachel and Jamie went to the station. Jamie gave a necklace to", "patch_prefix": "Then, Jamie and Rachel went to the station. Rachel gave a necklace to", "clean_answer": " Rachel", "patch_answer": " Jamie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Amanda and Bryan went to the station. Bryan gave a kiss to", "patch_prefix": "Then, Bryan and Amanda went to the station. Amanda gave a kiss to", "clean_answer": " Amanda", "patch_answer": " Bryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Aaron and Billy went to the office. Billy gave a kiss to", "patch_prefix": "Then, Billy and Aaron went to the office. Aaron gave a kiss to", "clean_answer": " Aaron", "patch_answer": " Billy", "case": "ioi_dataset"}
{"clean_prefix": "Then, William and Bryan went to the restaurant. Bryan gave a snack to", "patch_prefix": "Then, Bryan and William went to the restaurant. William gave a snack to", "clean_answer": " William", "patch_answer": " Bryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Katherine and Sara went to the store. Sara gave a computer to", "patch_prefix": "Then, Sara and Katherine went to the store. Katherine gave a computer to", "clean_answer": " Katherine", "patch_answer": " Sara", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bill and Kenneth went to the hospital. Kenneth gave a bone to", "patch_prefix": "Then, Kenneth and Bill went to the hospital. Bill gave a bone to", "clean_answer": " Bill", "patch_answer": " Kenneth", "case": "ioi_dataset"}
{"clean_prefix": "Then, Michael and Amber went to the station. Amber gave a necklace to", "patch_prefix": "Then, Amber and Michael went to the station. Michael gave a necklace to", "clean_answer": " Michael", "patch_answer": " Amber", "case": "ioi_dataset"}
{"clean_prefix": "Then, Albert and Stephanie went to the office. Stephanie gave a necklace to", "patch_prefix": "Then, Stephanie and Albert went to the office. Albert gave a necklace to", "clean_answer": " Albert", "patch_answer": " Stephanie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kelly and James went to the hospital. James gave a kiss to", "patch_prefix": "Then, James and Kelly went to the hospital. Kelly gave a kiss to", "clean_answer": " Kelly", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kyle and Amanda went to the house. Amanda gave a snack to", "patch_prefix": "Then, Amanda and Kyle went to the house. Kyle gave a snack to", "clean_answer": " Kyle", "patch_answer": " Amanda", "case": "ioi_dataset"}
{"clean_prefix": "Then, Rachel and Aaron went to the station. Aaron gave a computer to", "patch_prefix": "Then, Aaron and Rachel went to the station. Rachel gave a computer to", "clean_answer": " Rachel", "patch_answer": " Aaron", "case": "ioi_dataset"}
{"clean_prefix": "Then, Patrick and Angela went to the school. Angela gave a bone to", "patch_prefix": "Then, Angela and Patrick went to the school. Patrick gave a bone to", "clean_answer": " Patrick", "patch_answer": " Angela", "case": "ioi_dataset"}
{"clean_prefix": "Then, Lisa and Daniel went to the garden. Daniel gave a computer to", "patch_prefix": "Then, Daniel and Lisa went to the garden. Lisa gave a computer to", "clean_answer": " Lisa", "patch_answer": " Daniel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kelly and Christina went to the station. Christina gave a bone to", "patch_prefix": "Then, Christina and Kelly went to the station. Kelly gave a bone to", "clean_answer": " Kelly", "patch_answer": " Christina", "case": "ioi_dataset"}
{"clean_prefix": "Then, Robert and Steven went to the garden. Steven gave a bone to", "patch_prefix": "Then, Steven and Robert went to the garden. Robert gave a bone to", "clean_answer": " Robert", "patch_answer": " Steven", "case": "ioi_dataset"}
{"clean_prefix": "Then, Katie and Michelle went to the school. Michelle gave a basketball to", "patch_prefix": "Then, Michelle and Katie went to the school. Katie gave a basketball to", "clean_answer": " Katie", "patch_answer": " Michelle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Sara and Travis went to the school. Travis gave a drink to", "patch_prefix": "Then, Travis and Sara went to the school. Sara gave a drink to", "clean_answer": " Sara", "patch_answer": " Travis", "case": "ioi_dataset"}
{"clean_prefix": "Then, Erin and Megan went to the garden. Megan gave a computer to", "patch_prefix": "Then, Megan and Erin went to the garden. Erin gave a computer to", "clean_answer": " Erin", "patch_answer": " Megan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Sarah and Finn went to the restaurant. Finn gave a ring to", "patch_prefix": "Then, Finn and Sarah went to the restaurant. Sarah gave a ring to", "clean_answer": " Sarah", "patch_answer": " Finn", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jason and Sean went to the garden. Sean gave a kiss to", "patch_prefix": "Then, Sean and Jason went to the garden. Jason gave a kiss to", "clean_answer": " Jason", "patch_answer": " Sean", "case": "ioi_dataset"}
{"clean_prefix": "Then, Mark and Andrea went to the restaurant. Andrea gave a basketball to", "patch_prefix": "Then, Andrea and Mark went to the restaurant. Mark gave a basketball to", "clean_answer": " Mark", "patch_answer": " Andrea", "case": "ioi_dataset"}
{"clean_prefix": "Then, Adam and Amy went to the garden. Amy gave a kiss to", "patch_prefix": "Then, Amy and Adam went to the garden. Adam gave a kiss to", "clean_answer": " Adam", "patch_answer": " Amy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Michael and Crystal went to the station. Crystal gave a necklace to", "patch_prefix": "Then, Crystal and Michael went to the station. Michael gave a necklace to", "clean_answer": " Michael", "patch_answer": " Crystal", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bradley and Patrick went to the store. Patrick gave a snack to", "patch_prefix": "Then, Patrick and Bradley went to the store. Bradley gave a snack to", "clean_answer": " Bradley", "patch_answer": " Patrick", "case": "ioi_dataset"}
{"clean_prefix": "Then, Samuel and Kenneth went to the restaurant. Kenneth gave a necklace to", "patch_prefix": "Then, Kenneth and Samuel went to the restaurant. Samuel gave a necklace to", "clean_answer": " Samuel", "patch_answer": " Kenneth", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christina and Anthony went to the restaurant. Anthony gave a drink to", "patch_prefix": "Then, Anthony and Christina went to the restaurant. Christina gave a drink to", "clean_answer": " Christina", "patch_answer": " Anthony", "case": "ioi_dataset"}
{"clean_prefix": "Then, Matthew and Adam went to the restaurant. Adam gave a ring to", "patch_prefix": "Then, Adam and Matthew went to the restaurant. Matthew gave a ring to", "clean_answer": " Matthew", "patch_answer": " Adam", "case": "ioi_dataset"}
{"clean_prefix": "Then, Alexander and David went to the house. David gave a bone to", "patch_prefix": "Then, David and Alexander went to the house. Alexander gave a bone to", "clean_answer": " Alexander", "patch_answer": " David", "case": "ioi_dataset"}
{"clean_prefix": "Then, Thomas and Bryan went to the station. Bryan gave a kiss to", "patch_prefix": "Then, Bryan and Thomas went to the station. Thomas gave a kiss to", "clean_answer": " Thomas", "patch_answer": " Bryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Sarah and Thomas went to the restaurant. Thomas gave a bone to", "patch_prefix": "Then, Thomas and Sarah went to the restaurant. Sarah gave a bone to", "clean_answer": " Sarah", "patch_answer": " Thomas", "case": "ioi_dataset"}
{"clean_prefix": "Then, Scott and Kevin went to the office. Kevin gave a kiss to", "patch_prefix": "Then, Kevin and Scott went to the office. Scott gave a kiss to", "clean_answer": " Scott", "patch_answer": " Kevin", "case": "ioi_dataset"}
{"clean_prefix": "Then, Shannon and Ryan went to the school. Ryan gave a snack to", "patch_prefix": "Then, Ryan and Shannon went to the school. Shannon gave a snack to", "clean_answer": " Shannon", "patch_answer": " Ryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Tyler and Cody went to the hospital. Cody gave a basketball to", "patch_prefix": "Then, Cody and Tyler went to the hospital. Tyler gave a basketball to", "clean_answer": " Tyler", "patch_answer": " Cody", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bradley and Richard went to the store. Richard gave a basketball to", "patch_prefix": "Then, Richard and Bradley went to the store. Bradley gave a basketball to", "clean_answer": " Bradley", "patch_answer": " Richard", "case": "ioi_dataset"}
{"clean_prefix": "Then, Nicole and Christopher went to the house. Christopher gave a ring to", "patch_prefix": "Then, Christopher and Nicole went to the house. Nicole gave a ring to", "clean_answer": " Nicole", "patch_answer": " Christopher", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jessica and Mason went to the store. Mason gave a basketball to", "patch_prefix": "Then, Mason and Jessica went to the store. Jessica gave a basketball to", "clean_answer": " Jessica", "patch_answer": " Mason", "case": "ioi_dataset"}
{"clean_prefix": "Then, Shannon and Kyle went to the garden. Kyle gave a drink to", "patch_prefix": "Then, Kyle and Shannon went to the garden. Shannon gave a drink to", "clean_answer": " Shannon", "patch_answer": " Kyle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bradley and Angela went to the garden. Angela gave a kiss to", "patch_prefix": "Then, Angela and Bradley went to the garden. Bradley gave a kiss to", "clean_answer": " Bradley", "patch_answer": " Angela", "case": "ioi_dataset"}
{"clean_prefix": "Then, Heather and Laura went to the station. Laura gave a bone to", "patch_prefix": "Then, Laura and Heather went to the station. Heather gave a bone to", "clean_answer": " Heather", "patch_answer": " Laura", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bryan and Amy went to the hospital. Amy gave a computer to", "patch_prefix": "Then, Amy and Bryan went to the hospital. Bryan gave a computer to", "clean_answer": " Bryan", "patch_answer": " Amy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Amanda and Jennifer went to the garden. Jennifer gave a bone to", "patch_prefix": "Then, Jennifer and Amanda went to the garden. Amanda gave a bone to", "clean_answer": " Amanda", "patch_answer": " Jennifer", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bill and Jessica went to the school. Jessica gave a bone to", "patch_prefix": "Then, Jessica and Bill went to the school. Bill gave a bone to", "clean_answer": " Bill", "patch_answer": " Jessica", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kenneth and Joshua went to the store. Joshua gave a necklace to", "patch_prefix": "Then, Joshua and Kenneth went to the store. Kenneth gave a necklace to", "clean_answer": " Kenneth", "patch_answer": " Joshua", "case": "ioi_dataset"}
{"clean_prefix": "Then, Brandon and Nicole went to the station. Nicole gave a snack to", "patch_prefix": "Then, Nicole and Brandon went to the station. Brandon gave a snack to", "clean_answer": " Brandon", "patch_answer": " Nicole", "case": "ioi_dataset"}
{"clean_prefix": "Then, Finn and Lindsey went to the station. Lindsey gave a basketball to", "patch_prefix": "Then, Lindsey and Finn went to the station. Finn gave a basketball to", "clean_answer": " Finn", "patch_answer": " Lindsey", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jamie and Steven went to the store. Steven gave a snack to", "patch_prefix": "Then, Steven and Jamie went to the store. Jamie gave a snack to", "clean_answer": " Jamie", "patch_answer": " Steven", "case": "ioi_dataset"}
{"clean_prefix": "Then, Justin and Patrick went to the station. Patrick gave a kiss to", "patch_prefix": "Then, Patrick and Justin went to the station. Justin gave a kiss to", "clean_answer": " Justin", "patch_answer": " Patrick", "case": "ioi_dataset"}
{"clean_prefix": "Then, Michelle and Sophie went to the office. Sophie gave a snack to", "patch_prefix": "Then, Sophie and Michelle went to the office. Michelle gave a snack to", "clean_answer": " Michelle", "patch_answer": " Sophie", "case": "ioi_dataset"}
{"clean_prefix": "Then, Allison and Ashley went to the garden. Ashley gave a necklace to", "patch_prefix": "Then, Ashley and Allison went to the garden. Allison gave a necklace to", "clean_answer": " Allison", "patch_answer": " Ashley", "case": "ioi_dataset"}
{"clean_prefix": "Then, Melissa and Angela went to the garden. Angela gave a computer to", "patch_prefix": "Then, Angela and Melissa went to the garden. Melissa gave a computer to", "clean_answer": " Melissa", "patch_answer": " Angela", "case": "ioi_dataset"}
{"clean_prefix": "Then, Aaron and Heather went to the school. Heather gave a computer to", "patch_prefix": "Then, Heather and Aaron went to the school. Aaron gave a computer to", "clean_answer": " Aaron", "patch_answer": " Heather", "case": "ioi_dataset"}
{"clean_prefix": "Then, Angela and Laura went to the restaurant. Laura gave a basketball to", "patch_prefix": "Then, Laura and Angela went to the restaurant. Angela gave a basketball to", "clean_answer": " Angela", "patch_answer": " Laura", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jennifer and Joshua went to the garden. Joshua gave a snack to", "patch_prefix": "Then, Joshua and Jennifer went to the garden. Jennifer gave a snack to", "clean_answer": " Jennifer", "patch_answer": " Joshua", "case": "ioi_dataset"}
{"clean_prefix": "Then, Katie and Crystal went to the store. Crystal gave a necklace to", "patch_prefix": "Then, Crystal and Katie went to the store. Katie gave a necklace to", "clean_answer": " Katie", "patch_answer": " Crystal", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bob and Finn went to the hospital. Finn gave a ring to", "patch_prefix": "Then, Finn and Bob went to the hospital. Bob gave a ring to", "clean_answer": " Bob", "patch_answer": " Finn", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kevin and Sean went to the store. Sean gave a computer to", "patch_prefix": "Then, Sean and Kevin went to the store. Kevin gave a computer to", "clean_answer": " Kevin", "patch_answer": " Sean", "case": "ioi_dataset"}
{"clean_prefix": "Then, Joshua and Anthony went to the garden. Anthony gave a necklace to", "patch_prefix": "Then, Anthony and Joshua went to the garden. Joshua gave a necklace to", "clean_answer": " Joshua", "patch_answer": " Anthony", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christine and Emily went to the house. Emily gave a kiss to", "patch_prefix": "Then, Emily and Christine went to the house. Christine gave a kiss to", "clean_answer": " Christine", "patch_answer": " Emily", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jeffrey and Megan went to the station. Megan gave a bone to", "patch_prefix": "Then, Megan and Jeffrey went to the station. Jeffrey gave a bone to", "clean_answer": " Jeffrey", "patch_answer": " Megan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Brian and Joshua went to the office. Joshua gave a drink to", "patch_prefix": "Then, Joshua and Brian went to the office. Brian gave a drink to", "clean_answer": " Brian", "patch_answer": " Joshua", "case": "ioi_dataset"}
{"clean_prefix": "Then, Amy and Christina went to the store. Christina gave a drink to", "patch_prefix": "Then, Christina and Amy went to the store. Amy gave a drink to", "clean_answer": " Amy", "patch_answer": " Christina", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christine and Kelly went to the office. Kelly gave a basketball to", "patch_prefix": "Then, Kelly and Christine went to the office. Christine gave a basketball to", "clean_answer": " Christine", "patch_answer": " Kelly", "case": "ioi_dataset"}
{"clean_prefix": "Then, Ryan and Jeremy went to the house. Jeremy gave a kiss to", "patch_prefix": "Then, Jeremy and Ryan went to the house. Ryan gave a kiss to", "clean_answer": " Ryan", "patch_answer": " Jeremy", "case": "ioi_dataset"}
{"clean_prefix": "Then, Charles and Kelly went to the school. Kelly gave a necklace to", "patch_prefix": "Then, Kelly and Charles went to the school. Charles gave a necklace to", "clean_answer": " Charles", "patch_answer": " Kelly", "case": "ioi_dataset"}
{"clean_prefix": "Then, Megan and Travis went to the garden. Travis gave a computer to", "patch_prefix": "Then, Travis and Megan went to the garden. Megan gave a computer to", "clean_answer": " Megan", "patch_answer": " Travis", "case": "ioi_dataset"}
{"clean_prefix": "Then, Rebecca and Bryan went to the hospital. Bryan gave a snack to", "patch_prefix": "Then, Bryan and Rebecca went to the hospital. Rebecca gave a snack to", "clean_answer": " Rebecca", "patch_answer": " Bryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Benjamin and Anthony went to the office. Anthony gave a drink to", "patch_prefix": "Then, Anthony and Benjamin went to the office. Benjamin gave a drink to", "clean_answer": " Benjamin", "patch_answer": " Anthony", "case": "ioi_dataset"}
{"clean_prefix": "Then, Andrea and Richard went to the store. Richard gave a kiss to", "patch_prefix": "Then, Richard and Andrea went to the store. Andrea gave a kiss to", "clean_answer": " Andrea", "patch_answer": " Richard", "case": "ioi_dataset"}
{"clean_prefix": "Then, Patrick and Richard went to the garden. Richard gave a basketball to", "patch_prefix": "Then, Richard and Patrick went to the garden. Patrick gave a basketball to", "clean_answer": " Patrick", "patch_answer": " Richard", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jeffrey and Bradley went to the office. Bradley gave a ring to", "patch_prefix": "Then, Bradley and Jeffrey went to the office. Jeffrey gave a ring to", "clean_answer": " Jeffrey", "patch_answer": " Bradley", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christina and Ryan went to the restaurant. Ryan gave a ring to", "patch_prefix": "Then, Ryan and Christina went to the restaurant. Christina gave a ring to", "clean_answer": " Christina", "patch_answer": " Ryan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Anthony and Paul went to the house. Paul gave a basketball to", "patch_prefix": "Then, Paul and Anthony went to the house. Anthony gave a basketball to", "clean_answer": " Anthony", "patch_answer": " Paul", "case": "ioi_dataset"}
{"clean_prefix": "Then, Rachel and John went to the store. John gave a computer to", "patch_prefix": "Then, John and Rachel went to the store. Rachel gave a computer to", "clean_answer": " Rachel", "patch_answer": " John", "case": "ioi_dataset"}
{"clean_prefix": "Then, Paul and Patrick went to the restaurant. Patrick gave a necklace to", "patch_prefix": "Then, Patrick and Paul went to the restaurant. Paul gave a necklace to", "clean_answer": " Paul", "patch_answer": " Patrick", "case": "ioi_dataset"}
{"clean_prefix": "Then, Thomas and Billy went to the store. Billy gave a necklace to", "patch_prefix": "Then, Billy and Thomas went to the store. Thomas gave a necklace to", "clean_answer": " Thomas", "patch_answer": " Billy", "case": "ioi_dataset"}
{"clean_prefix": "Then, James and Christine went to the store. Christine gave a kiss to", "patch_prefix": "Then, Christine and James went to the store. James gave a kiss to", "clean_answer": " James", "patch_answer": " Christine", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jonathan and Rachel went to the store. Rachel gave a snack to", "patch_prefix": "Then, Rachel and Jonathan went to the store. Jonathan gave a snack to", "clean_answer": " Jonathan", "patch_answer": " Rachel", "case": "ioi_dataset"}
{"clean_prefix": "Then, Sean and Joseph went to the school. Joseph gave a bone to", "patch_prefix": "Then, Joseph and Sean went to the school. Sean gave a bone to", "clean_answer": " Sean", "patch_answer": " Joseph", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bradley and Christopher went to the garden. Christopher gave a ring to", "patch_prefix": "Then, Christopher and Bradley went to the garden. Bradley gave a ring to", "clean_answer": " Bradley", "patch_answer": " Christopher", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jesse and Joshua went to the office. Joshua gave a kiss to", "patch_prefix": "Then, Joshua and Jesse went to the office. Jesse gave a kiss to", "clean_answer": " Jesse", "patch_answer": " Joshua", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jennifer and Andrew went to the restaurant. Andrew gave a ring to", "patch_prefix": "Then, Andrew and Jennifer went to the restaurant. Jennifer gave a ring to", "clean_answer": " Jennifer", "patch_answer": " Andrew", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jose and Susan went to the hospital. Susan gave a ring to", "patch_prefix": "Then, Susan and Jose went to the hospital. Jose gave a ring to", "clean_answer": " Jose", "patch_answer": " Susan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Joshua and Jonathan went to the school. Jonathan gave a snack to", "patch_prefix": "Then, Jonathan and Joshua went to the school. Joshua gave a snack to", "clean_answer": " Joshua", "patch_answer": " Jonathan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Bob and Gregory went to the school. Gregory gave a snack to", "patch_prefix": "Then, Gregory and Bob went to the school. Bob gave a snack to", "clean_answer": " Bob", "patch_answer": " Gregory", "case": "ioi_dataset"}
{"clean_prefix": "Then, Jacob and James went to the hospital. James gave a kiss to", "patch_prefix": "Then, James and Jacob went to the hospital. Jacob gave a kiss to", "clean_answer": " Jacob", "patch_answer": " James", "case": "ioi_dataset"}
{"clean_prefix": "Then, Christopher and Robert went to the office. Robert gave a drink to", "patch_prefix": "Then, Robert and Christopher went to the office. Christopher gave a drink to", "clean_answer": " Christopher", "patch_answer": " Robert", "case": "ioi_dataset"}
{"clean_prefix": "Then, Benjamin and Susan went to the store. Susan gave a kiss to", "patch_prefix": "Then, Susan and Benjamin went to the store. Benjamin gave a kiss to", "clean_answer": " Benjamin", "patch_answer": " Susan", "case": "ioi_dataset"}
{"clean_prefix": "Then, Albert and William went to the garden. William gave a bone to", "patch_prefix": "Then, William and Albert went to the garden. Albert gave a bone to", "clean_answer": " Albert", "patch_answer": " William", "case": "ioi_dataset"}
{"clean_prefix": "Then, Cody and Megan went to the school. Megan gave a ring to", "patch_prefix": "Then, Megan and Cody went to the school. Cody gave a ring to", "clean_answer": " Cody", "patch_answer": " Megan", "case": "ioi_dataset"}
{"clean_prefix": "Then, David and Nicole went to the store. Nicole gave a basketball to", "patch_prefix": "Then, Nicole and David went to the store. David gave a basketball to", "clean_answer": " David", "patch_answer": " Nicole", "case": "ioi_dataset"}
{"clean_prefix": "Then, Kyle and Amber went to the station. Amber gave a drink to", "patch_prefix": "Then, Amber and Kyle went to the station. Kyle gave a drink to", "clean_answer": " Kyle", "patch_answer": " Amber", "case": "ioi_dataset"}
{"clean_prefix": "Then, Helen and Robert went to the garden. Robert gave a necklace to", "patch_prefix": "Then, Robert and Helen went to the garden. Helen gave a necklace to", "clean_answer": " Helen", "patch_answer": " Robert", "case": "ioi_dataset"}
{"clean_prefix": "Then, Brian and Kyle went to the restaurant. Kyle gave a snack to", "patch_prefix": "Then, Kyle and Brian went to the restaurant. Brian gave a snack to", "clean_answer": " Brian", "patch_answer": " Kyle", "case": "ioi_dataset"}
{"clean_prefix": "Then, Sara and Sean went to the office. Sean gave a basketball to", "patch_prefix": "Then, Sean and Sara went to the office. Sara gave a basketball to", "clean_answer": " Sara", "patch_answer": " Sean", "case": "ioi_dataset"}
{"clean_prefix": "Then, Douglas and David went to the station. David gave a ring to", "patch_prefix": "Then, David and Douglas went to the station. Douglas gave a ring to", "clean_answer": " Douglas", "patch_answer": " David", "case": "ioi_dataset"}
